Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཐོང་བ་པོ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It reveals the world because there is no perceiving of feelings, perceptions, formative predispositions, or consciousness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It reveals the world because there is no perceiving of the sense fields, the sensory elements, or the links of dependent origination.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It reveals the world because there is no perceiving of [any of the attributes or goals], up to and including all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པའོ། །གསོལ་པ།
en: So it is, Subhūti, that the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་གཟུགས་མཐོང་བ་མ་མཆིས་པའི་སླད་དུ་སྟོན་པ་ལགས།
en: Blessed Lord, how is it that it reveals the world because there is no perceiving of physical forms?

source: ཇི་ལྟར་ན་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཐོང་བ་མ་མཆིས་པའི་སླད་དུ་སྟོན་པ་ལགས།
en: How is it that it reveals the world because there is no perceiving of feelings, perceptions, formative predispositions, or consciousness?

source: ཇི་ལྟར་ན་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཐོང་བ་མ་མཆིས་པའི་སླད་དུ་སྟོན་པ་ལགས།
en: How is it that it reveals the world because there is no perceiving of the sense fields, the sensory elements, or the links of dependent origination?

source: ཇི་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མཐོང་བ་མ་མཆིས་པའི་སླད་དུ་སྟོན་པ་ལགས།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཞི་བཅུ་དྲུག་པ།
en: How is it that it reveals the world because there is no perceiving of [any of the attributes or goals], up to and including all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་གཟུགས་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། གཟུགས་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: Subhūti,” replied the Blessed One, “it is when there is no consciousness arising that apprehends physical forms that it reveals the world because there is no perceiving of physical forms.

source: །ནམ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། རྣམ་པར་ཤེས་པ་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It is when there is no consciousness arising that apprehends feelings, perceptions, formative predispositions, or consciousness that it reveals the world because there is no perceiving of consciousness [or the other aggregates]. {

source: །ནམ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: Ki.IV: 72} It is when there is no consciousness arising that apprehends the sense fields, the sensory elements, or the links of dependent origination that it reveals the world because there is no perceiving of the links of dependent origination [and so forth].

source: །ནམ་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ། །ནམ་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་།
en: It is when there is no consciousness arising that apprehends the perfections that it reveals the world because there is no perceiving of the perfections.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It is when there is no consciousness arising that apprehends all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, or the eighteen distinct qualities of the buddhas that it reveals the world because there is no perceiving of the eighteen distinct qualities of the buddhas [or the other causal and fruitional attributes].

source: །ནམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ།
en: It is when there is no consciousness arising that apprehends [the goals], up to and including all-aspect omniscience that it reveals the world because there is no perceiving of all-aspect omniscience [and so forth].

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པའོ།
en: So it is, Subhūti, that this profound perfection of wisdom gives birth to the tathāgatas, and reveals the world to them. “

source: །རབ་འབྱོར་གཞན་ཡང་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་འཇིག་རྟེན་དུ་སྟོང་པ་ཞེས་རྗོད་དེ།
en: Moreover, Subhūti, if you ask in what way the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them, in this case, Subhūti, the perfection of wisdom expressly states that in the world phenomena are empty.

source: འཇིག་རྟེན་དུ་ཅི་སྟོང་པ་ཞེས་རྗོད་ཅེ་ན། ཕུང་པོ་ལྔ་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: If you ask what it expressly states in the world to be empty, it expressly states that in the world the five psycho-physical aggregates are empty.

source: །སྐྱེ་མཆེད་བཅུ་གཉིས་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the twelve sense fields are empty.

source: །ཁམས་བཅྭོ་བརྒྱད་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the eighteen sensory elements are empty.

source: །རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the twelve links of dependent origination are empty.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the six perfections are empty.

source: །ནང་སྟོང་པ་ཉིད་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the emptiness of internal phenomena is empty.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are empty.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: It expressly states that in the world the thirty-seven factors conducive to enlightenment are empty.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are empty.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་ངོ་ཞེས་བྱ་བར་འཇིག་རྟེན་དུ་རྗོད་དོ།
en: It expressly states that in the world [the goals], up to and including all-aspect omniscience, are empty.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པའོ།
en: So it is, Subhūti, that the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them. {Ki.

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་སྟོང་ཞེས་བྱ་བར་སྟོན་ན། འཇིག་རྟེན་སྟོང་ཞེས་བྱ་བར་རྗོད། འཇིག་རྟེན་སྟོང་ཞེས་བྱ་བར་ཤེས་པར་བྱེད་དེ།
en: IV: 73} “Moreover, Subhūti, when the perfection of wisdom reveals to the tathāgatas that the world is empty, it expressly states that the world is empty and makes it known that the world is empty.

source: རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པའོ།
en: So it is, Subhūti, that the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that the world is empty.

source: འཇིག་རྟེན་ཇི་ལྟར་སྟོང་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། འཇིག་རྟེན་ན་ཕུང་པོ་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is empty, it reveals that in the world the psycho-physical aggregates are empty.

source: །འཇིག་རྟེན་ན་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་ངོ་ཞེས་བྱ་བར་སྟོན་ཏོ། །འཇིག་རྟེན་ན་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་དང་། ནང་སྟོང་པ་ཉིད་དང་།
en: It reveals that in the world the sense fields, the sensory elements, and the links of dependent origination are empty.

source: ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏོ། །འཇིག་རྟེན་ན་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་།
en: It reveals that in the world the six perfections, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, and the thirty-seven factors conducive to enlightenment are empty.

source: ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that in the world the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways of liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are empty.

source: །འཇིག་རྟེན་ན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that in the world the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are empty.

source: །འཇིག་རྟེན་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྟོང་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that in the world [the goals], up to and including all-aspect omniscience, are empty.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་ཏོ།
en: So it is, Subhūti, that the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, this perfection of wisdom reveals to the tathāgatas that the world is inconceivable.

source: ཇི་ལྟར་འཇིག་རྟེན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is inconceivable, it reveals that the world comprising the psycho-physical aggregates is inconceivable.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འཇིག་རྟེན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is inconceivable.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is inconceivable. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་དབེན་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, this profound perfection of wisdom reveals to the tathāgatas that the world is void.

source: འཇིག་རྟེན་ཇི་ལྟར་དབེན་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་དབེན་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is void, it reveals that the world comprising the psycho-physical aggregates is void.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་དབེན་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is void.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་དབེན་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is void.

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་མཐའ་ལས་འདས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that infinite worlds are empty.

source: ཇི་ལྟར་འཇིག་རྟེན་མཐའ་ལས་འདས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་མཐའ་ལས་འདས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that infinite worlds are empty, it reveals that infinite worlds comprising the psycho-physical aggregates are empty.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་མཐའ་ལས་འདས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that infinite worlds comprising the sense fields, the sensory elements, and the links of dependent origination are empty.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་མཐའ་ལས་འདས་པ་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།།
en: It reveals that infinite worlds comprising [all the other attributes and goals], up to and including all-aspect omniscience, are empty. “

source: རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that the world is empty of essential nature.

source: ཇི་ལྟར་འཇིག་རྟེན་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is empty of essential nature, it reveals that the world comprising the psycho-physical aggregates is empty of essential nature.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is empty of essential nature.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is empty of essential nature.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་སྐྱེད་ཅིང་འཇིག་རྟེན་སྟོན་པའོ།
en: So it is, Subhūti, that the perfection of wisdom gives birth to the tathāgatas, and reveals the world to them. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཞེས་བྱར་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that the world is empty of the essential nature of nonentities.

source: ཇི་ལྟར་འཇིག་རྟེན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is empty of the essential nature of nonentities, it reveals that the world comprising the psycho-physical aggregates is empty of the essential nature of nonentities.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is empty of the essential nature of nonentities.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is empty of the essential nature of nonentities. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་ཞི་ཞེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that the world is at peace.

source: ཇི་ལྟར་འཇིག་རྟེན་ཞི་ཞེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་ཞི་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is at peace, it reveals that the world comprising the psycho-physical aggregates is at peace.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་ཞི་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is at peace.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་ཞི་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is at peace. “

source: །རབ་འབྱོར་གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི། དེ་བཞིན་གཤེགས་པ་ལ་འཇིག་རྟེན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་སྟོན་ཏེ།
en: Moreover, Subhūti, the perfection of wisdom reveals to the tathāgatas that the world is emptiness.

source: ཇི་ལྟར་འཇིག་རྟེན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་སྟོན་ཅེ་ན། ཕུང་པོའི་འཇིག་རྟེན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: If you ask how it reveals that the world is emptiness, it reveals that the world comprising the psycho-physical aggregates is emptiness.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་འཇིག་རྟེན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising the sense fields, the sensory elements, and the links of dependent origination is emptiness.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཇིག་རྟེན་སྟོང་པ་ཉིད་ཅེས་བྱ་བར་སྟོན་ཏོ།
en: It reveals that the world comprising [all the other attributes and goals], up to and including all-aspect omniscience, is emptiness. {Ki.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཇིག་རྟེན་ཇི་ལྟར་སྟོན་ཅེ་ན། ཅི་ནས་ཀྱང་འཇིག་རྟེན་འདིའི་འདུ་ཤེས་སུ་འང་མི་འགྱུར་ལ། འཇིག་རྟེན་ཕ་རོལ་གྱི་འདུ་ཤེས་སུའང་མི་འགྱུར་བ་དེ་ལྟར་སྟོན་ཏེ།
en: Subhūti, if you ask how this profound perfection of wisdom reveals the world to them, it reveals in all ways that there are no notions of this world and there are no notions of other worlds.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་གིས་འཇིག་རྟེན་འདིའི་འདུ་ཤེས་སུ་འགྱུར་བའམ། འཇིག་རྟེན་ཕ་རོལ་གྱི་འདུ་ཤེས་སུ་འགྱུར་བའི་ཆོས་དེ་ལྟ་བུ་མེད་དོ། །གསོལ་པ།
en: If you ask why, it is because the sort of phenomena that would bring about notions of this world and notions of other worlds do not exist.” “

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་ཆེན་པོའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Blessed Lord, this perfection of wisdom is established for a great purpose.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་བསམ་གྱིས་མི་ཁྱབ་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Blessed Lord, this perfection of wisdom is established for an inconceivable purpose.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་དཔག་ཏུ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Blessed Lord, this perfection of wisdom is established for an inestimable purpose.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་གཞལ་དུ་མ་མཆིས་པའི་སླད་དུ་ཉེ་བར་གནས་སོ།
en: Blessed Lord, this perfection of wisdom is established for an unappraisable purpose.

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་མི་མཉམ་པ་དང་མཉམ་པའི་སླད་དུ་ཉེ་བར་གནས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is established for a purpose that is equal to the unequaled.” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་ཆེན་པོའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: This perfection of wisdom is established for a great purpose.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དོན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། དོན་དཔག་ཏུ་མེད་པ་དང་། དོན་གཞལ་དུ་མེད་པ་དང་། དོན་མི་མཉམ་པ་དང་མཉམ་པའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: Subhūti, this perfection of wisdom is established for an inconceivable purpose, an inestimable purpose, an unappraisable purpose, and a purpose that is equal to the unequaled. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དོན་ཆེན་པོའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དོན་ཆེན་པོ་སྟེ། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་བསྐྱབ་པའི་དོན་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏང་བའི་དོན་ཏོ།
en: Subhūti, if you ask how the perfection of wisdom is established for a great purpose, this, Subhūti, denotes the great purpose of the tathāgatas, arhats, completely awakened buddhas—the purpose of granting refuge to all beings and the purpose of not forsaking any beings. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དོན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་སངས་རྒྱས་ཉིད་དང་། དེ་བཞིན་གཤེགས་པ་ཉིད་དང་། རང་བྱུང་ཉིད་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: Subhūti, if you ask how the perfection of wisdom is established for an inconceivable purpose, it is the case, Subhūti, that buddhahood, the nature of the tathāgata, self-origination, and all-aspect omniscience are inconceivable.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དོན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: For this reason, Subhūti, the perfection of wisdom is established for the inconceivable purpose of the tathāgatas, arhats, completely awakened buddhas. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དོན་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་སེམས་ཅན་དུ་བསྡུ་བས་བསྡུས་པ་ལ། གང་གིས་སངས་རྒྱས་ཉིད་དང་དེ་བཞིན་གཤེགས་པ་ཉིད་དང་རང་བྱུང་ཉིད་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བསམ་པ་དང་། དཔག་པར་ནུས་པ་དེ་ལྟ་བུ་གང་ཡང་མེད་དེ།
en: Subhūti, if you ask how the perfection of wisdom is established for an inestimable purpose, Subhūti, there is no one whosoever within the classes of beings who can conceive of or estimate buddhahood, the nature of the tathāgata, self-origination, or all-aspect omniscience.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དོན་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཉེ་བར་གནས་སོ།
en: For this reason, Subhūti, the perfection of wisdom is established for the inestimable purpose of the tathāgatas, arhats, completely awakened buddhas. “
